#  TASK2 Pandas

## 5.1.1 Series

In [2]:
import pandas as pd

In [3]:
obj=pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj=pd.Series([4,7,-5,3],index=['a','b','c','d'])

In [7]:
obj

a    4
b    7
c   -5
d    3
dtype: int64

In [8]:
obj['a']

4

In [9]:
obj[['a','c']]

a    4
c   -5
dtype: int64

In [10]:
obj[obj>0]

a    4
b    7
d    3
dtype: int64

In [12]:

obj*2

a     8
b    14
c   -10
d     6
dtype: int64

In [17]:
import numpy as np
np.exp(obj)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

In [18]:
'b' in obj

True

In [19]:
'g' in obj

False

In [22]:
mydict={'a':10,'b':20,'c':30,'d':40}

In [24]:
obj=pd.Series(mydict,index=['a','b','c','e'])

In [25]:
obj

a    10.0
b    20.0
c    30.0
e     NaN
dtype: float64

In [26]:
obj.isnull()

a    False
b    False
c    False
e     True
dtype: bool

In [27]:
pd.isnull(obj)

a    False
b    False
c    False
e     True
dtype: bool

In [28]:
obj

a    10.0
b    20.0
c    30.0
e     NaN
dtype: float64

In [29]:
obj2=pd.Series(mydict,index=['a','b','d'])

In [30]:
obj+obj2

a    20.0
b    40.0
c     NaN
d     NaN
e     NaN
dtype: float64

In [31]:
obj.name='test1'

In [32]:
obj.index.name='yoyo'

In [33]:
obj

yoyo
a    10.0
b    20.0
c    30.0
e     NaN
Name: test1, dtype: float64

## 5.1.2 DataFrame

In [34]:
data={'state':['ohio','ohio','ohio','nevada','nevada','nevada'],'year':[20,30,40,50,60,70],'pop':[1.5,2.5,3.5,4.5,5.5,6.5]}

In [35]:
frame=pd.DataFrame(data)

In [36]:
frame

    state  year  pop
0    ohio    20  1.5
1    ohio    30  2.5
2    ohio    40  3.5
3  nevada    50  4.5
4  nevada    60  5.5
5  nevada    70  6.5

In [41]:
frame=pd.DataFrame(data,columns=['year','pop','state'])

In [42]:
frame

   year  pop   state
0    20  1.5    ohio
1    30  2.5    ohio
2    40  3.5    ohio
3    50  4.5  nevada
4    60  5.5  nevada
5    70  6.5  nevada

In [47]:
frame=pd.DataFrame(data,columns=['year','pop','state','ayaya'],index=['one','two','three','four','five','six'])

In [48]:
frame

       year  pop   state ayaya
one      20  1.5    ohio   NaN
two      30  2.5    ohio   NaN
three    40  3.5    ohio   NaN
four     50  4.5  nevada   NaN
five     60  5.5  nevada   NaN
six      70  6.5  nevada   NaN

In [49]:
frame.state

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [50]:
frame['state']

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [54]:

frame.loc['three']

year       40
pop       3.5
state    ohio
ayaya     NaN
Name: three, dtype: object

In [55]:
frame['ayaya']=0.25

In [56]:
frame

       year  pop   state  ayaya
one      20  1.5    ohio   0.25
two      30  2.5    ohio   0.25
three    40  3.5    ohio   0.25
four     50  4.5  nevada   0.25
five     60  5.5  nevada   0.25
six      70  6.5  nevada   0.25

In [57]:
frame['ayaya']=np.arange(6)

In [58]:
frame

       year  pop   state  ayaya
one      20  1.5    ohio      0
two      30  2.5    ohio      1
three    40  3.5    ohio      2
four     50  4.5  nevada      3
five     60  5.5  nevada      4
six      70  6.5  nevada      5

In [59]:
val=pd.Series([0.2,0.3,0.4],index=['two','four','six'])

In [60]:
frame['ayaya']=val

In [61]:
frame

       year  pop   state  ayaya
one      20  1.5    ohio    NaN
two      30  2.5    ohio    0.2
three    40  3.5    ohio    NaN
four     50  4.5  nevada    0.3
five     60  5.5  nevada    NaN
six      70  6.5  nevada    0.4

In [62]:
frame['blue']=frame.state=='ohio'

In [63]:
frame

       year  pop   state  ayaya   blue
one      20  1.5    ohio    NaN   True
two      30  2.5    ohio    0.2   True
three    40  3.5    ohio    NaN   True
four     50  4.5  nevada    0.3  False
five     60  5.5  nevada    NaN  False
six      70  6.5  nevada    0.4  False

In [64]:
del frame['blue']

In [65]:
frame.columns

Index(['year', 'pop', 'state', 'ayaya'], dtype='object')

In [66]:
mydict={'first':{'c1':2.5,'c2': 3.5},'second':{'c1':3.2,'c3':5.2}}

In [67]:
frame=pd.DataFrame(mydict)

In [68]:
frame

    first  second
c1    2.5     3.2
c2    3.5     NaN
c3    NaN     5.2

In [69]:
frame.T

         c1   c2   c3
first   2.5  3.5  NaN
second  3.2  NaN  5.2

In [70]:
frame.values

array([[2.5, 3.2],
       [3.5, nan],
       [nan, 5.2]])

##  5.1.3 索引对象

In [72]:
obj=pd.Series(range(3),index=['a','b','c'])

In [73]:
index=obj.index

In [74]:
index

Index(['a', 'b', 'c'], dtype='object')

In [75]:
index[:-1]

Index(['a', 'b'], dtype='object')

In [76]:
labels=pd.Index(np.arange(5))

In [77]:
labels

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [78]:
obj2=pd.Series([1,1,1,1,1],index=labels)

In [79]:
obj2

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [80]:
obj2.index is labels

True

## 5.2.1 重建索引

In [81]:
frame

    first  second
c1    2.5     3.2
c2    3.5     NaN
c3    NaN     5.2

In [82]:
frame.reindex(['c3','c1','c2'])

    first  second
c3    NaN     5.2
c1    2.5     3.2
c2    3.5     NaN

In [84]:
frame.reindex(columns=['second','first'])

    second  first
c1     3.2    2.5
c2     NaN    3.5
c3     5.2    NaN

In [86]:
frame.loc[['c2','c3'],['second','first']]

    second  first
c2     NaN    3.5
c3     5.2    NaN

## 5.2.2 轴向上删除条目

In [89]:
frame.drop('c1')

    first  second
c2    3.5     NaN
c3    NaN     5.2

In [92]:

frame.drop(['c1','c2'])

    first  second
c3    NaN     5.2

In [103]:

frame.drop('first',axis=1)

    second
c1     3.2
c2     NaN
c3     5.2

!!!axis=1 指删除列，0值行，或者可以写axis='columns'

In [109]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['a','b','c','d'],columns=['a','b','c','d'])

In [110]:
data

    a   b   c   d
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [111]:
data.drop('a',axis=0)

    a   b   c   d
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [112]:
data.drop('a',axis=1)

    b   c   d
a   1   2   3
b   5   6   7
c   9  10  11
d  13  14  15

In [114]:
data.drop('a',axis=1,inplace=True)

In [115]:
data

    b   c   d
a   1   2   3
b   5   6   7
c   9  10  11
d  13  14  15

inplace=true 即直接对原对象修改

## 5.2.3 索引、选择与过滤